Revit 2027 API
ExportDWGSettings.SetDXFExportOptions Method
 Sets the options stored in these settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetDXFExportOptions(
	DXFExportOptions options
)
Public Sub SetDXFExportOptions (
	options As DXFExportOptions
)
public:
void SetDXFExportOptions(
	DXFExportOptions^ options
)
member SetDXFExportOptions :
        options : DXFExportOptions -> unit
Parameters
options DXFExportOptions
 The options.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportDWGSettings Class
Autodesk.Revit.DB Namespace